In [3]:
import pandas as pd
import statsmodels as st

In [31]:
Energy_MW=pd.read_csv('./Energy/Milestone 1 Dataset/hrl_load_metered - 20170201-20200131.csv')

In [32]:
Energy_MW.head()

,datetime_beginning_utc,datetime_beginning_ept,nerc_region,mkt_region,zone,load_area,mw,is_verified
0,2/1/2017 5:00,2/1/2017 0:00,RFC,WEST,DUQ,DUQ,1419.881,True
1,2/1/2017 6:00,2/1/2017 1:00,RFC,WEST,DUQ,DUQ,1379.505,True
2,2/1/2017 7:00,2/1/2017 2:00,RFC,WEST,DUQ,DUQ,1366.106,True
3,2/1/2017 8:00,2/1/2017 3:00,RFC,WEST,DUQ,DUQ,1364.453,True
4,2/1/2017 9:00,2/1/2017 4:00,RFC,WEST,DUQ,DUQ,1391.265,True

In [6]:
Energy_MW.head()

,datetime_beginning_utc,datetime_beginning_ept,nerc_region,mkt_region,zone,load_area,mw,is_verified
0,2/1/2017 5:00,2/1/2017 0:00,RFC,WEST,DUQ,DUQ,1419.881,True
1,2/1/2017 6:00,2/1/2017 1:00,RFC,WEST,DUQ,DUQ,1379.505,True
2,2/1/2017 7:00,2/1/2017 2:00,RFC,WEST,DUQ,DUQ,1366.106,True
3,2/1/2017 8:00,2/1/2017 3:00,RFC,WEST,DUQ,DUQ,1364.453,True
4,2/1/2017 9:00,2/1/2017 4:00,RFC,WEST,DUQ,DUQ,1391.265,True

In [7]:
Energy_MW.shape

(26280, 8)

In [33]:
Temp_Drybulb=pd.read_csv('./Energy/Milestone 1 Dataset/hr_temp_20170201-20200131_subset.csv')

In [34]:
Temp_Drybulb.head()

,STATION,DATE,REPORT_TYPE,SOURCE,HourlyDryBulbTemperature
0,72520514762,2017-02-01T00:53:00,FM-15,7,37.0
1,72520514762,2017-02-01T01:53:00,FM-15,7,37.0
2,72520514762,2017-02-01T02:53:00,FM-15,7,36.0
3,72520514762,2017-02-01T03:53:00,FM-15,7,36.0
4,72520514762,2017-02-01T04:53:00,FM-15,7,36.0

In [10]:
Temp_Drybulb.shape

(26280, 5)

In [11]:
Energy_MW.datetime_beginning_ept=Energy_MW.datetime_beginning_ept.astype('datetime64')

In [12]:
Energy_MW.datetime_beginning_ept.dtype

dtype('<M8[ns]')

In [13]:
Energy_MW.datetime_beginning_ept

0       2017-02-01 00:00:00
1       2017-02-01 01:00:00
2       2017-02-01 02:00:00
3       2017-02-01 03:00:00
4       2017-02-01 04:00:00
                ...
26275   2020-01-31 19:00:00
26276   2020-01-31 20:00:00
26277   2020-01-31 21:00:00
26278   2020-01-31 22:00:00
26279   2020-01-31 23:00:00
Name: datetime_beginning_ept, Length: 26280, dtype: datetime64[ns]

In [14]:
Energy_MW.head()

,datetime_beginning_utc,datetime_beginning_ept,nerc_region,mkt_region,zone,load_area,mw,is_verified
0,2/1/2017 5:00,2017-02-01 00:00:00,RFC,WEST,DUQ,DUQ,1419.881,True
1,2/1/2017 6:00,2017-02-01 01:00:00,RFC,WEST,DUQ,DUQ,1379.505,True
2,2/1/2017 7:00,2017-02-01 02:00:00,RFC,WEST,DUQ,DUQ,1366.106,True
3,2/1/2017 8:00,2017-02-01 03:00:00,RFC,WEST,DUQ,DUQ,1364.453,True
4,2/1/2017 9:00,2017-02-01 04:00:00,RFC,WEST,DUQ,DUQ,1391.265,True

In [15]:
Temp_Drybulb.DATE=Temp_Drybulb.DATE.astype('datetime64')

In [16]:
Temp_Drybulb.DATE.dtype

dtype('<M8[ns]')

In [17]:

Temp_Drybulb.DATE.dt.strftime('%y-%m-%y %H')


# TicketsDF['submitDate'].dt.strftime('%H:%M')

0        17-02-17 00
1        17-02-17 01
2        17-02-17 02
3        17-02-17 03
4        17-02-17 04
            ...
26275    20-01-20 19
26276    20-01-20 20
26277    20-01-20 21
26278    20-01-20 22
26279    20-01-20 23
Name: DATE, Length: 26280, dtype: object

In [25]:
Temp_Drybulb.head()

,STATION,DATE,REPORT_TYPE,SOURCE,HourlyDryBulbTemperature
0,72520514762,2017-02-01 00:53:00,FM-15,7,37.0
1,72520514762,2017-02-01 01:53:00,FM-15,7,37.0
2,72520514762,2017-02-01 02:53:00,FM-15,7,36.0
3,72520514762,2017-02-01 03:53:00,FM-15,7,36.0
4,72520514762,2017-02-01 04:53:00,FM-15,7,36.0

In [26]:
Energy_MW.datetime_beginning_ept.dt.strftime('%y-%m-%d %H')

0        17-02-01 00
1        17-02-01 01
2        17-02-01 02
3        17-02-01 03
4        17-02-01 04
            ...
26275    20-01-31 19
26276    20-01-31 20
26277    20-01-31 21
26278    20-01-31 22
26279    20-01-31 23
Name: datetime_beginning_ept, Length: 26280, dtype: object

In [27]:
df=pd.merge(Temp_Drybulb[['DATE','HourlyDryBulbTemperature']],Energy_MW[['datetime_beginning_ept','mw']],how='left',left_on=Temp_Drybulb.DATE.dt.strftime('%y-%m-%d %H'),right_on=Energy_MW.datetime_beginning_ept.dt.strftime('%y-%m-%d %H'))

In [19]:
# df=pd.merge(Temp_Drybulb[['DATE','HourlyDryBulbTemperature']],Energy_MW[['datetime_beginning_ept','mw']],how='left',left_on=Temp_Drybulb.DATE.dt.strftime('%y-%m-%d %H'),right_on=Energy_MW.datetime_beginning_ept.dt.strftime('%y-%m-%y %H'))

In [20]:
# df=pd.merge(Temp_Drybulb[['DATE','HourlyDryBulbTemperature']],Energy_MW[['datetime_beginning_ept','mw']],how='left',left_on=Temp_Drybulb.DATE.dt.hour,right_on=Energy_MW.datetime_beginning_ept.dt.hour)

In [28]:
df.head()

,key_0,DATE,HourlyDryBulbTemperature,datetime_beginning_ept,mw
0,17-02-01 00,2017-02-01 00:53:00,37.0,2017-02-01 00:00:00,1419.881
1,17-02-01 01,2017-02-01 01:53:00,37.0,2017-02-01 01:00:00,1379.505
2,17-02-01 02,2017-02-01 02:53:00,36.0,2017-02-01 02:00:00,1366.106
3,17-02-01 03,2017-02-01 03:53:00,36.0,2017-02-01 03:00:00,1364.453
4,17-02-01 04,2017-02-01 04:53:00,36.0,2017-02-01 04:00:00,1391.265

In [29]:
df.shape

(26283, 5)

In [23]:
df.isna().values.any()

True

In [24]:
pd.merge(Energy_MW[['datetime_beginning_ept','mw']],Temp_Drybulb[['DATE','HourlyDryBulbTemperature']],right_on='DATE',left_on='datetime_beginning_ept',how='left')

      datetime_beginning_ept        mw DATE  HourlyDryBulbTemperature
0        2017-02-01 00:00:00  1419.881  NaT                       NaN
1        2017-02-01 01:00:00  1379.505  NaT                       NaN
2        2017-02-01 02:00:00  1366.106  NaT                       NaN
3        2017-02-01 03:00:00  1364.453  NaT                       NaN
4        2017-02-01 04:00:00  1391.265  NaT                       NaN
...                      ...       ...  ...                       ...
26275    2020-01-31 19:00:00  1618.484  NaT                       NaN
26276    2020-01-31 20:00:00  1580.925  NaT                       NaN
26277    2020-01-31 21:00:00  1545.354  NaT                       NaN
26278    2020-01-31 22:00:00  1478.832  NaT                       NaN
26279    2020-01-31 23:00:00  1405.188  NaT                       NaN

[26280 rows x 4 columns]